

a1 = 9  # количестов единиц
a0 = 9  # количестов нулей
ss = 7  # количестов смены - переходов значения между нулями и единицами

# ниже количество едениц и нулей в массиве при каждой смене от 1 к 0 или наоборот
s = [2, 1, 1, 4, 1, 2, 5, 2, 1, 1, 4, 1, 2, 1, 4, 2, 1, 1, 4, 1, 1, 1, 4, 1, 2, 1, 1, 4, 1, 1, 1, 3, 1, 1, 2, 1, 1, 4, 1, 1, 1, 1, 2, 2]
x = [9]
z = [0]
r = [0]
r[0] = s[0]
c = 0
w = 0
wr = 1
sst = 1  # стартовое значение
tr = sst
# далее процедура формирования массива из исходных данных
for i in s:
        if sst == 1:
            x[0] = 1
            a1 = a1-1
            print(x)
            sst = 0
            r[0] = r[0] -1
            print(s[0])
            print(a1)
            z[0] = r[0]

        else:
            for c in z:
                # print(s[i])
                if r[0] > 0:
                    x.insert(wr, tr)
                    r[0] = r[0]-1
                    wr = wr + 1
                else:
                    if tr == 1:
                        tr = 0
                    else:
                        tr = 1

        z[0] = s[i+1]
        r[0] = s[i+1]

        print(x)
        print(wr)

        c = 0
        print(z)





bin_result = a1
n = int(bin_result, 2)
print(n.to_bytes((n.bit_length()+7) // 8).decode('utf-8'))



